tap "adoptopenjdk/openjdk"
tap "bramstein/webfonttools"
tap "dart-lang/dart"
tap "epk/epk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "mgmeyers/pdfannots2json"
tap "nikitabobko/tap"
tap "sambadevi/powerlevel9k"
tap "sass/sass"
tap "wix/brew"
# Search tool like grep, but optimized for programmers
brew "ack"
# Library for manipulating PNG images
brew "libpng"
# Library for command-line editing
brew "readline"
# Shell extension to jump to frequently used directories
brew "autojump"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Manipulates BibTeX databases
brew "bib-tool"
# GNU binary tools for native development
brew "binutils"
# Parser generator
brew "bison"
# Install RubyGems as Homebrew formulae
brew "brew-gem"
# Like cat but displays content with syntax highlighting
brew "ccat"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get, unpack, build, and install modules from CPAN
brew "cpanminus"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# File comparison utilities
brew "diffutils"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# More intuitive version of du in rust
brew "dust"
# Useful examples at the command-line
brew "eg-examples"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# OpenType text shaping engine
brew "harfbuzz"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GNU compiler collection
brew "gcc"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Geospatial Data Abstraction Library
brew "gdal"
# GNU database manager
brew "gdbm"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU implementation of time utility
brew "gnu-time"
# GNU implementation of which utility
brew "gnu-which"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# GNU grep, egrep and fgrep
brew "grep"
# Popular GNU data compression program
brew "gzip"
# Configurable static site generator
brew "hugo"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Just Another Gibbs Sampler for Bayesian MCMC simulation
brew "jags"
# Lightweight and flexible command-line JSON processor
brew "jq"
# YAML Parser
brew "libyaml"
# Command-line note taker
brew "jrnl"
# Julia installer and version multiplexer
brew "juliaup"
# Platform built on V8 to build network applications
brew "node"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Interactive environments for writing and running code
brew "jupyterlab"
# Highly capable, feature-rich programming language
brew "perl"
# Add indentation to LaTeX files
brew "latexindent"
# Simple terminal UI for git commands
brew "lazygit"
# Portable Foreign Function Interface library
brew "libffi"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Package manager for the Lua programming language
brew "luarocks"
# Mac App Store command-line interface
brew "mas"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Interactive cheatsheet tool for the command-line
brew "navi"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Pandoc filter for numbering and cross-referencing
brew "pandoc-crossref"
# Pandoc filter for including code from source files
brew "pandoc-include-code"
# Render and include figures in Pandoc documents using many plotting toolkits
brew "pandoc-plot"
# Search PDFs for strings matching a regular expression
brew "pdfgrep"
# General-purpose scripting language
brew "php", restart_service: :changed
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Theme for zsh
brew "powerlevel10k"
# Show ps output as a tree
brew "pstree"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Ruby version manager
brew "rbenv"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Wrapper around ripgrep that adds multiple rich file types
brew "ripgrep-all"
# Extremely fast tool to remove dupes and other lint from your filesystem
brew "rmlint"
# Utility that provides fast incremental file transfer
brew "rsync"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Safe, concurrent, practical language
brew "rust"
# Terminal multiplexer with VT100/ANSI terminal emulation
brew "screen"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Terminal-based client for Spotify
brew "spotify-tui"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Version control system designed to be a better CVS
brew "subversion"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# TUI to view and query tabular files (CSV,TSV, Parquet, etc.)
brew "tabiew"
# Utility-first CSS framework
brew "tailwindcss"
# Feature-rich console based todo list manager
brew "task"
# Shell wrapper for Taskwarrior commands
brew "tasksh"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Implementation of the Language Server Protocol for LaTeX
brew "texlab"
# Code-search similar to ack
brew "the_silver_searcher"
# Programmatically correct mistyped console commands
brew "thefuck"
# Command-line time tracking application
brew "timewarrior"
# Terminal multiplexer
brew "tmux"
# Command-line interface to the freedesktop.org trashcan
brew "trash-cli", link: true
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Maintained ctags implementation
brew "universal-ctags"
# Vi 'workalike' with many additional features
brew "vim"
# Full-screen terminal interface for Taskwarrior
brew "vit"
# Watch files and take action when they change
brew "watchman"
# Weather app for the terminal
brew "wego"
# Internet file retriever
brew "wget"
# Utilities to create and convert Web Open Font File (WOFF) files
brew "woff2"
# Fake keyboard/mouse input and window management for X
brew "xdotool"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Next-generation plugin manager for zsh
brew "zplug"
# UNIX shell (command interpreter)
brew "zsh"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Extract annotations from PDFs and convert them to JSON
brew "mgmeyers/pdfannots2json/pdfannots2json"
# A badass zsh theme with more power than a normal earthling
brew "sambadevi/powerlevel9k/powerlevel9k"
# Stylesheet Preprocessor
brew "sass/sass/sass"
# Apple simulator utilities
brew "wix/brew/applesimutils"
# Password manager that keeps all passwords secure behind one password
cask "1password", args: { appdir: "/Applications" }
# AdoptOpenJDK OpenJDK (Java) Development Kit
cask "adoptopenjdk8", args: { appdir: "/Applications" }
# AdoptOpenJDK OpenJDK (Java) Development Kit
cask "adoptopenjdk8-jre", args: { appdir: "/Applications" }
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Status bar app to overcome time-constrained WiFi networks
cask "airpass", args: { appdir: "/Applications" }
# Application launcher and productivity software
cask "alfred", args: { appdir: "/Applications" }
# Tools for building Android applications
cask "android-studio", args: { appdir: "/Applications" }
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Tool to hide status bar icons
cask "dozer", args: { appdir: "/Applications" }
# Web browser
cask "firefox", args: { appdir: "/Applications" }
# Screen colour temperature controller
cask "flux-app", args: { appdir: "/Applications" }
cask "font-3270-nerd-font"
cask "font-agave-nerd-font"
cask "font-anonymice-nerd-font"
cask "font-arimo-nerd-font"
cask "font-aurulent-sans-mono-nerd-font"
cask "font-bigblue-terminal-nerd-font"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-charter"
cask "font-code-new-roman-nerd-font"
cask "font-cousine-nerd-font"
cask "font-daddy-time-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
cask "font-fira-mono-nerd-font"
cask "font-fira-sans"
cask "font-go-mono-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-hack", args: { appdir: "/Applications" }
cask "font-hack-nerd-font", args: { appdir: "/Applications" }
cask "font-hasklig"
cask "font-hasklug-nerd-font"
cask "font-heavy-data-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-inconsolata"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-iosevka"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-lekton-nerd-font"
cask "font-liberation-nerd-font"
cask "font-m+-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monofur-nerd-font"
cask "font-monoid"
cask "font-monoid-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-noto-nerd-font"
cask "font-open-dyslexic-nerd-font"
cask "font-overpass-nerd-font"
cask "font-profont-nerd-font"
cask "font-proggy-clean-tt-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-sf-mono-nerd-font"
cask "font-shure-tech-mono-nerd-font"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"
cask "font-space-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-tinos-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "font-victor-mono"
cask "font-victor-mono-nerd-font"
# Free and open-source image editor
cask "gimp"
# Performance software for cyclists, runners and triathletes
cask "goldencheetah"
# Web browser
cask "google-chrome", args: { appdir: "/Applications" }
# Desktop automation application
cask "hammerspoon"
# Utility to hide menu bar items
cask "hiddenbar"
# System monitoring app
cask "istat-menus", args: { appdir: "/Applications" }
# Open-source screen recorder built with web technology
cask "kap", args: { appdir: "/Applications" }
# File archiver
cask "keka"
# Electronics design automation suite
cask "kicad", args: { appdir: "/Applications" }
# Extensible two-pane file manager
cask "marta"
# Minimal installer for conda
cask "miniconda", args: { appdir: "/Applications" }
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Calculate the overall performance of an investment portfolio
cask "portfolioperformance"
# Collaboration platform for API development
cask "postman", args: { appdir: "/Applications" }
# G-code generator for 3D printers (RepRap, Makerbot, Ultimaker etc.)
cask "prusaslicer", args: { appdir: "/Applications" }
# Instant messaging application focusing on security
cask "signal"
# Digital design and prototyping platform
cask "sketch", args: { appdir: "/Applications" }
# PDF reader and note-taking application
cask "skim"
# Team communication and collaboration software
cask "slack", args: { appdir: "/Applications" }
# Music streaming service
cask "spotify", args: { appdir: "/Applications" }
# Pomodoro timer for Taskwarrior
cask "taskwarrior-pomodoro"
# Unpacks archive files
cask "the-unarchiver", args: { appdir: "/Applications" }
# Open-source BitTorrent client
cask "transmission", args: { appdir: "/Applications" }
# 3D printer and slicing GUI
cask "ultimaker-cura", args: { appdir: "/Applications" }
# Open-source code editor
cask "visual-studio-code", args: { appdir: "/Applications" }
# Multimedia player
cask "vlc"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Native desktop client for WhatsApp
cask "whatsapp"
# HTML to PDF renderer
cask "wkhtmltopdf"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Video communication and virtual meeting platform
cask "zoom", args: { appdir: "/Applications" }
# Collect, organise, cite, and share research sources
cask "zotero"
# Desktop client for the Zulip team chat platform
cask "zulip"
mas "DigiDoc4", id: 1370791134
mas "eduVPN", id: 1317704208
mas "Web eID", id: 1576665083
mas "Xcode", id: 497799835
vscode "affenwiesel.matlab-formatter"
vscode "anthropic.claude-code"
vscode "asvetliakov.vscode-neovim"
vscode "bnavetta.zoterolatex"
vscode "bramvanbilsen.matlab-code-run"
vscode "budparr.language-hugo-vscode"
vscode "chrischinchilla.vscode-pandoc"
vscode "colinfang.markdown-julia"
vscode "eamodio.gitlens"
vscode "eliostruyf.vscode-front-matter"
vscode "evilz.vscode-reveal"
vscode "gimly81.matlab"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "james-yu.latex-workshop"
vscode "jgclark.vscode-todo-highlight"
vscode "julialang.language-julia"
vscode "kylebarron.stata-enhanced"
vscode "masonliu.exercism"
vscode "mblode.zotero"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "notzaki.pandocciter"
vscode "notzaki.vscode-bookdown"
vscode "posit.air-vscode"
vscode "quarto.quarto"
vscode "reditorsupport.r"
vscode "reditorsupport.r-syntax"
vscode "robbowen.synthwave-vscode"
vscode "skyran.matlab-snippets"
vscode "sumneko.lua"
vscode "tecosaur.latex-utilities"
vscode "tianyishi.rmarkdown"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "yeaoh.statarun"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
