tap "bramstein/webfonttools"
tap "caskroom/cask"
tap "caskroom/drivers"
tap "caskroom/fonts"
tap "homebrew/bundle"
tap "homebrew/completions"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/science"
tap "homebrew/versions"
tap "homebrew/x11"
tap "neovim/neovim"
tap "rcoedo/tap"
tap "staticfloat/julia"
tap "zegervdv/zathura"
cask "java"
brew "gmp"
brew "isl"
brew "mpfr"
brew "libmpc"
brew "gcc"
brew "docbook"
brew "asciidoc"
brew "freetype"
brew "fontconfig"
brew "gettext"
brew "libffi"
brew "pixman"
brew "perl"
brew "git", args: ["without-completions"]
brew "openssl"
brew "pkg-config"
brew "gdbm"
brew "sqlite"
brew "atk"
brew "autoconf"
brew "autoenv"
brew "automake"
brew "bib-tool"
brew "boost"
brew "brew-cask-completion"
brew "gmp@4"
brew "isl@0.12"
brew "cloog"
brew "cmake"
brew "coreutils"
brew "cowsay"
brew "cscope"
brew "curl"
brew "zeromq"
brew "czmq"
brew "desktop-file-utils"
brew "docker"
brew "docker-machine"
brew "doxygen"
brew "epstool"
brew "fdk-aac"
brew "fribidi"
brew "lame"
brew "libogg"
brew "x264"
brew "xvid"
brew "ffmpeg", args: ["with-fdk-aac", "with-freetype", "with-libass", "with-libvorbis", "with-libvpx", "with-opus", "with-x265"]
brew "fftw"
brew "figlet"
brew "findutils", args: ["with-default-names"]
brew "fltk"
brew "libtool"
brew "fontforge"
brew "freetds", args: ["with-unixodbc"]
brew "freexl"
brew "fzf"
brew "mpfr@2"
brew "libmpc@0.8"
brew "gcc@4.8"
brew "gd"
brew "geos"
brew "giflib"
brew "json-c"
brew "proj"
brew "liblwgeom"
brew "libspatialite"
brew "gdal"
brew "gibo"
brew "gifsicle"
brew "git-extras"
brew "git-flow"
brew "gl2ps"
brew "gnome-icon-theme"
brew "lua"
brew "gnuplot", args: ["with-aquaterm"]
brew "libtasn1"
brew "nettle"
brew "go"
brew "graphicsmagick"
brew "grep"
brew "gsettings-desktop-schemas"
brew "gsl"
brew "hicolor-icon-theme"
brew "gtk+3"
brew "haskell-stack"
brew "szip"
brew "libcroco"
brew "imagemagick@6", args: ["with-fontconfig", "with-librsvg"]
brew "intltool"
brew "jags"
brew "leptonica"
brew "libass"
brew "libvorbis"
brew "libvpx"
brew "opus"
brew "libav"
brew "libevent"
brew "libssh2"
brew "libmagic"
brew "libmatio"
brew "librsvg"
brew "libsodium"
brew "libtermkey"
brew "libuv"
brew "libvterm"
brew "libyaml"
brew "llvm"
brew "llvm@3.7"
brew "luajit"
brew "lzlib"
brew "makedepend"
brew "matlab2tikz"
brew "mbedtls"
brew "metis"
brew "mpd"
brew "mpv"
brew "msgpack"
brew "mysql"
brew "ncdu"
brew "ncmpcpp"
brew "unibilium"
brew "neovim", args: ["HEAD"]
brew "nginx"
brew "node"
brew "plotutils"
brew "qhull"
brew "openjpeg"
brew "optipng"
brew "pandoc"
brew "pandoc-citeproc"
brew "pandoc-crossref"
brew "pcre2"
brew "pdftk"
brew "pngquant"
brew "ponysay"
brew "poppler"
brew "unixodbc"
brew "psqlodbc"
brew "pyenv"
brew "qt"
brew "pyqt"
brew "qscintilla2"
brew "quantlib"
brew "ranger"
brew "rename"
brew "ripgrep"
brew "ruby"
brew "sdl"
brew "shpotify"
brew "sqliteodbc"
brew "swig"
brew "task"
brew "taskd"
brew "tasksh"
brew "tbb"
brew "tesseract"
brew "texi2html"
brew "texinfo"
brew "the_silver_searcher"
brew "thefuck"
brew "tmux"
brew "tree"
brew "udunits"
brew "vim"
brew "vit"
brew "wget"
brew "x265"
brew "yasm"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "bramstein/webfonttools/woff2"
brew "homebrew/science/cmdstan"
brew "homebrew/science/dynare"
brew "rcoedo/tap/apcom"
brew "staticfloat/julia/openblas-julia"
brew "staticfloat/julia/arpack-julia"
brew "staticfloat/julia/llvm37-julia"
brew "staticfloat/julia/suite-sparse-julia"
brew "staticfloat/julia/julia"
brew "zegervdv/zathura/girara"
brew "zegervdv/zathura/zathura"
brew "zegervdv/zathura/zathura-pdf-poppler"
cask "cuda"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-inconsolata"
cask "gitkraken"
cask "mactex"
cask "nteract"
cask "qlstephen"
cask "soundcleod"
cask "sourcetree"
